tutorials/Figure10b/0/PhaseChangeHeat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.001";
    object      PhaseChangeHeat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
256
(
0
-0
-0
-1.06601e+12
-1.16864e+07
-0.284216
-1.74352e-07
4.54615e-14
...
)
;

boundaryField
{
    BotWall
    {
        type            calculated;
        value           uniform 1.03523e+10;
    }
    FreeStream
    {
        type            calculated;
        value           uniform 0;
    }
    FrontNBack
    {
        type            empty;
    }
    LeftSide
    {
        type            symmetryPlane;
    }
    RightSide
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
