tutorials/Figure10b/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.001";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
256
(
(-6.16008e-24 0.000693313 0)
(-1.82105e-23 -0.00144674 0)
(-2.97373e-23 0.00393669 0)
(-4.51189e-23 -0.0110103 0)
(-9.08814e-23 -0.0957103 0)
(-3.40598e-22 -0.123798 0)
(-5.29853e-22 -0.0924568 0)
(-5.62733e-22 -0.087577 0)
...
)
;

boundaryField
{
    BotWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    FreeStream
    {
        type            zeroGradient;
    }
    FrontNBack
    {
        type            empty;
    }
    LeftSide
    {
        type            symmetryPlane;
    }
    RightSide
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
