tutorials/Figure10b/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.001";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
256
(
40.5406
131.857
2.31257
-8.77398
-1.04035
0.296552
0.101715
-0.0281743
...
)
;

boundaryField
{
    BotWall
    {
        type            calculated;
        value           uniform 40.5406;
    }
    FreeStream
    {
        type            calculated;
        value           uniform -0.0382264;
    }
    FrontNBack
    {
        type            empty;
    }
    LeftSide
    {
        type            symmetryPlane;
    }
    RightSide
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
