tutorials/Figure10b/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    BotWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       255;
    }
    FreeStream
    {
        type            patch;
        nFaces          1;
        startFace       256;
    }
    FrontNBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          512;
        startFace       257;
    }
    LeftSide
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          256;
        startFace       769;
    }
    RightSide
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          256;
        startFace       1025;
    }
)

// ************************************************************************* //
