tutorials/Figure10b/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cell;

setFormat       raw;

sets
(

    CLine
    {
        type    midPoint;
        axis    y;
        start   ( 0.001 0 0.00025 );
        end     ( 0.001 0.001 0.00025 );
        //nPoints 100;
    }

);


fields          ( alpha1 T PhaseChangeEnergy U);


// ************************************************************************* //
